# Introducción a Pandas

Esta es una introducción al paquete *pandas*, de uso común en la ciencia de datos, significa *panel data*, que es un término de econometría para conjuntos de datos de intervalos temporales

In [1]:
variable_python = "Alfonso"

In [2]:
print(variable_python)

Alfonso

Case:

```python
TitleCase: dotnet
camelCase: java
snake_case: python
kebap-case: css
```
    
en python se usa el snake_case

In [3]:
# esto es un comentario
# y lo siguiente es una función:
def hola_mundo():
    return "hola mundo"

In [4]:
hola_mundo()

'hola mundo'

# Instalar Pandas

```bash
pip install pandas
```
ó
```
conda install pandas
```

In [5]:
import pandas as pd
import numpy as np

# Series y Dataframes

## https://github.com/afoone/caipc-laberit-oct2022


Las *series* son columnas de datos. Un Dataframe es una matríz compuesta de varias series (columnas). Vamos a crear un dataframe

In [6]:
ventas = {
    'libros': [3, 2, 1, 0],
    'discos': [0,1,2,3]
}

In [7]:
ventas

{'libros': [3, 2, 1, 0], 'discos': [0, 1, 2, 3]}

In [8]:
print(ventas)

{'libros': [3, 2, 1, 0], 'discos': [0, 1, 2, 3]}

In [9]:
ventas_df = pd.DataFrame(ventas)

In [11]:
ventas_df

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [15]:
ventas_df.head() # devuelve los 5 primeros elementos

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [18]:
ventas_df.head(2) # devuelve sólo los dos priimeros

   libros  discos
0       3       0
1       2       1

In [19]:
ventas_df.describe() # estadísticos básicos

         libros    discos
count  4.000000  4.000000
mean   1.500000  1.500000
std    1.290994  1.290994
min    0.000000  0.000000
25%    0.750000  0.750000
50%    1.500000  1.500000
75%    2.250000  2.250000
max    3.000000  3.000000

In [20]:
# puedo asignar etiquetas a las filas dando un índice

ventas_df = pd.DataFrame(ventas, index = ['Enero', 'Febrero', 'Marzo', 'Abril'] )

In [21]:
ventas_df

         libros  discos
Enero         3       0
Febrero       2       1
Marzo         1       2
Abril         0       3